hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_sei_regs.h
/*
 * OE_RX (RO)
 *
 * RX drive state
 * 0: input
 * 1: output
 */
#define SEI_CTRL_XCVR_PIN_OE_RX_MASK (0x40000UL)
#define SEI_CTRL_XCVR_PIN_OE_RX_SHIFT (18U)
#define SEI_CTRL_XCVR_PIN_OE_RX_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_PIN_OE_RX_MASK) >> SEI_CTRL_XCVR_PIN_OE_RX_SHIFT)

/*
 * DI_RX (RO)
 *
 * RX state
 * 0: data 0
 * 1: data 1
 */
#define SEI_CTRL_XCVR_PIN_DI_RX_MASK (0x20000UL)
#define SEI_CTRL_XCVR_PIN_DI_RX_SHIFT (17U)
#define SEI_CTRL_XCVR_PIN_DI_RX_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_PIN_DI_RX_MASK) >> SEI_CTRL_XCVR_PIN_DI_RX_SHIFT)

/*
 * DO_RX (RO)
 *
 * RX output
 * 0: data 0
 * 1: data 1
 */
#define SEI_CTRL_XCVR_PIN_DO_RX_MASK (0x10000UL)
#define SEI_CTRL_XCVR_PIN_DO_RX_SHIFT (16U)
#define SEI_CTRL_XCVR_PIN_DO_RX_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_PIN_DO_RX_MASK) >> SEI_CTRL_XCVR_PIN_DO_RX_SHIFT)

/*
 * OE_DE (RO)
 *
 * DE drive state
 * 0: input
 * 1: output
 */
#define SEI_CTRL_XCVR_PIN_OE_DE_MASK (0x400U)
#define SEI_CTRL_XCVR_PIN_OE_DE_SHIFT (10U)
#define SEI_CTRL_XCVR_PIN_OE_DE_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_PIN_OE_DE_MASK) >> SEI_CTRL_XCVR_PIN_OE_DE_SHIFT)

/*
 * DI_DE (RO)
 *
 * DE state
 * 0: data 0
 * 1: data 1
 */
#define SEI_CTRL_XCVR_PIN_DI_DE_MASK (0x200U)
#define SEI_CTRL_XCVR_PIN_DI_DE_SHIFT (9U)
#define SEI_CTRL_XCVR_PIN_DI_DE_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_PIN_DI_DE_MASK) >> SEI_CTRL_XCVR_PIN_DI_DE_SHIFT)

/*
 * DO_DE (RO)
 *
 * DE output
 * 0: data 0
 * 1: data 1
 */
#define SEI_CTRL_XCVR_PIN_DO_DE_MASK (0x100U)
#define SEI_CTRL_XCVR_PIN_DO_DE_SHIFT (8U)
#define SEI_CTRL_XCVR_PIN_DO_DE_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_PIN_DO_DE_MASK) >> SEI_CTRL_XCVR_PIN_DO_DE_SHIFT)

/*
 * OE_TX (RO)
 *
 * TX drive state
 * 0: input
 * 1: output
 */
#define SEI_CTRL_XCVR_PIN_OE_TX_MASK (0x4U)
#define SEI_CTRL_XCVR_PIN_OE_TX_SHIFT (2U)
#define SEI_CTRL_XCVR_PIN_OE_TX_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_PIN_OE_TX_MASK) >> SEI_CTRL_XCVR_PIN_OE_TX_SHIFT)

/*
 * DI_TX (RO)
 *
 * TX state
 * 0: data 0
 * 1: data 1
 */
#define SEI_CTRL_XCVR_PIN_DI_TX_MASK (0x2U)
#define SEI_CTRL_XCVR_PIN_DI_TX_SHIFT (1U)
#define SEI_CTRL_XCVR_PIN_DI_TX_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_PIN_DI_TX_MASK) >> SEI_CTRL_XCVR_PIN_DI_TX_SHIFT)

/*
 * DO_TX (RO)
 *
 * TX output
 * 0: data 0
 * 1: data 1
 */
#define SEI_CTRL_XCVR_PIN_DO_TX_MASK (0x1U)
#define SEI_CTRL_XCVR_PIN_DO_TX_SHIFT (0U)
#define SEI_CTRL_XCVR_PIN_DO_TX_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_PIN_DO_TX_MASK) >> SEI_CTRL_XCVR_PIN_DO_TX_SHIFT)

/* Bitfield definition for register of struct array CTRL: STATE */
/*
 * RECV_STATE (RO)
 *
 * FSM of asynchronous receive
 */
#define SEI_CTRL_XCVR_STATE_RECV_STATE_MASK (0x7000000UL)
#define SEI_CTRL_XCVR_STATE_RECV_STATE_SHIFT (24U)
#define SEI_CTRL_XCVR_STATE_RECV_STATE_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_STATE_RECV_STATE_MASK) >> SEI_CTRL_XCVR_STATE_RECV_STATE_SHIFT)

/*
 * SEND_STATE (RO)
 *
 * FSM of asynchronous transmit
 */
#define SEI_CTRL_XCVR_STATE_SEND_STATE_MASK (0x70000UL)
#define SEI_CTRL_XCVR_STATE_SEND_STATE_SHIFT (16U)
#define SEI_CTRL_XCVR_STATE_SEND_STATE_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_STATE_SEND_STATE_MASK) >> SEI_CTRL_XCVR_STATE_SEND_STATE_SHIFT)

/* Bitfield definition for register of struct array CTRL: IN_CFG */
/*
 * PRD_EN (RW)
 *
 * Enable period trigger (tigger 2)
 * 0: periodical trigger disabled
 * 1: periodical trigger enabled
 */
#define SEI_CTRL_TRG_IN_CFG_PRD_EN_MASK (0x800000UL)
#define SEI_CTRL_TRG_IN_CFG_PRD_EN_SHIFT (23U)
#define SEI_CTRL_TRG_IN_CFG_PRD_EN_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_IN_CFG_PRD_EN_SHIFT) & SEI_CTRL_TRG_IN_CFG_PRD_EN_MASK)
#define SEI_CTRL_TRG_IN_CFG_PRD_EN_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_IN_CFG_PRD_EN_MASK) >> SEI_CTRL_TRG_IN_CFG_PRD_EN_SHIFT)

/*
 * SYNC_SEL (RW)
 *
 * Synchronize sigal selection (tigger 2)
 * 0: trigger in 0
 * 1: trigger in 1
 * ...
 * 7: trigger in 7
 */
#define SEI_CTRL_TRG_IN_CFG_SYNC_SEL_MASK (0x70000UL)
#define SEI_CTRL_TRG_IN_CFG_SYNC_SEL_SHIFT (16U)
#define SEI_CTRL_TRG_IN_CFG_SYNC_SEL_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_IN_CFG_SYNC_SEL_SHIFT) & SEI_CTRL_TRG_IN_CFG_SYNC_SEL_MASK)
#define SEI_CTRL_TRG_IN_CFG_SYNC_SEL_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_IN_CFG_SYNC_SEL_MASK) >> SEI_CTRL_TRG_IN_CFG_SYNC_SEL_SHIFT)

/*
 * IN1_EN (RW)
 *
 * Enable trigger 1
 * 0: disable trigger 1
 * 1: enable trigger 1
 */
#define SEI_CTRL_TRG_IN_CFG_IN1_EN_MASK (0x8000U)
#define SEI_CTRL_TRG_IN_CFG_IN1_EN_SHIFT (15U)
#define SEI_CTRL_TRG_IN_CFG_IN1_EN_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_IN_CFG_IN1_EN_SHIFT) & SEI_CTRL_TRG_IN_CFG_IN1_EN_MASK)
#define SEI_CTRL_TRG_IN_CFG_IN1_EN_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_IN_CFG_IN1_EN_MASK) >> SEI_CTRL_TRG_IN_CFG_IN1_EN_SHIFT)

/*
 * IN1_SEL (RW)
 *
 * Trigger 1 sigal selection
 * 0: trigger in 0
 * 1: trigger in 1
 * ...
 * 7: trigger in 7
 */
#define SEI_CTRL_TRG_IN_CFG_IN1_SEL_MASK (0x700U)
#define SEI_CTRL_TRG_IN_CFG_IN1_SEL_SHIFT (8U)
#define SEI_CTRL_TRG_IN_CFG_IN1_SEL_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_IN_CFG_IN1_SEL_SHIFT) & SEI_CTRL_TRG_IN_CFG_IN1_SEL_MASK)
#define SEI_CTRL_TRG_IN_CFG_IN1_SEL_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_IN_CFG_IN1_SEL_MASK) >> SEI_CTRL_TRG_IN_CFG_IN1_SEL_SHIFT)

/*
 * IN0_EN (RW)
 *
 * Enable trigger 0
 * 0: disable trigger 1
 * 1: enable trigger 1
 */
#define SEI_CTRL_TRG_IN_CFG_IN0_EN_MASK (0x80U)
#define SEI_CTRL_TRG_IN_CFG_IN0_EN_SHIFT (7U)
#define SEI_CTRL_TRG_IN_CFG_IN0_EN_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_IN_CFG_IN0_EN_SHIFT) & SEI_CTRL_TRG_IN_CFG_IN0_EN_MASK)
#define SEI_CTRL_TRG_IN_CFG_IN0_EN_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_IN_CFG_IN0_EN_MASK) >> SEI_CTRL_TRG_IN_CFG_IN0_EN_SHIFT)

/*
 * IN0_SEL (RW)
 *
 * Trigger 0 sigal selection
 * 0: trigger in 0
 * 1: trigger in 1
 * ...
 * 7: trigger in 7
 */
#define SEI_CTRL_TRG_IN_CFG_IN0_SEL_MASK (0x7U)
#define SEI_CTRL_TRG_IN_CFG_IN0_SEL_SHIFT (0U)
#define SEI_CTRL_TRG_IN_CFG_IN0_SEL_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_IN_CFG_IN0_SEL_SHIFT) & SEI_CTRL_TRG_IN_CFG_IN0_SEL_MASK)
#define SEI_CTRL_TRG_IN_CFG_IN0_SEL_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_IN_CFG_IN0_SEL_MASK) >> SEI_CTRL_TRG_IN_CFG_IN0_SEL_SHIFT)

/* Bitfield definition for register of struct array CTRL: SW */
/*
 * SOFT (WC)
 *
 * Software trigger (tigger 3). this bit is self-clear
 * 0: trigger source disabled
 * 1: trigger source enabled
 */
#define SEI_CTRL_TRG_SW_SOFT_MASK (0x1U)
#define SEI_CTRL_TRG_SW_SOFT_SHIFT (0U)
#define SEI_CTRL_TRG_SW_SOFT_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_SW_SOFT_SHIFT) & SEI_CTRL_TRG_SW_SOFT_MASK)
#define SEI_CTRL_TRG_SW_SOFT_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_SW_SOFT_MASK) >> SEI_CTRL_TRG_SW_SOFT_SHIFT)

/* Bitfield definition for register of struct array CTRL: PRD_CFG */
/*
 * ARMING (RW)
 *
 * Wait for trigger synchronous before trigger
 * 0: Trigger directly
 * 1: Wait trigger source before period trigger
 */
#define SEI_CTRL_TRG_PRD_CFG_ARMING_MASK (0x10000UL)
#define SEI_CTRL_TRG_PRD_CFG_ARMING_SHIFT (16U)
#define SEI_CTRL_TRG_PRD_CFG_ARMING_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_PRD_CFG_ARMING_SHIFT) & SEI_CTRL_TRG_PRD_CFG_ARMING_MASK)
#define SEI_CTRL_TRG_PRD_CFG_ARMING_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_PRD_CFG_ARMING_MASK) >> SEI_CTRL_TRG_PRD_CFG_ARMING_SHIFT)

