hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_sei_regs.h
/*
 * WORD_IDX (RO)
 *
 * Word index
 */
#define SEI_CTRL_CMD_STS_WORD_IDX_MASK (0x1F0000UL)
#define SEI_CTRL_CMD_STS_WORD_IDX_SHIFT (16U)
#define SEI_CTRL_CMD_STS_WORD_IDX_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_STS_WORD_IDX_MASK) >> SEI_CTRL_CMD_STS_WORD_IDX_SHIFT)

/*
 * WORD_CNT (RO)
 *
 * Word counter
 */
#define SEI_CTRL_CMD_STS_WORD_CNT_MASK (0x1F00U)
#define SEI_CTRL_CMD_STS_WORD_CNT_SHIFT (8U)
#define SEI_CTRL_CMD_STS_WORD_CNT_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_STS_WORD_CNT_MASK) >> SEI_CTRL_CMD_STS_WORD_CNT_SHIFT)

/*
 * BIT_IDX (RO)
 *
 * Bit index
 */
#define SEI_CTRL_CMD_STS_BIT_IDX_MASK (0x1FU)
#define SEI_CTRL_CMD_STS_BIT_IDX_SHIFT (0U)
#define SEI_CTRL_CMD_STS_BIT_IDX_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_STS_BIT_IDX_MASK) >> SEI_CTRL_CMD_STS_BIT_IDX_SHIFT)

/* Bitfield definition for register of struct array CTRL: MIN */
/*
 * CMD_MIN (RW)
 *
 * minimum command value
 */
#define SEI_CTRL_CMD_TABLE_MIN_CMD_MIN_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_CMD_TABLE_MIN_CMD_MIN_SHIFT (0U)
#define SEI_CTRL_CMD_TABLE_MIN_CMD_MIN_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_MIN_CMD_MIN_SHIFT) & SEI_CTRL_CMD_TABLE_MIN_CMD_MIN_MASK)
#define SEI_CTRL_CMD_TABLE_MIN_CMD_MIN_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_MIN_CMD_MIN_MASK) >> SEI_CTRL_CMD_TABLE_MIN_CMD_MIN_SHIFT)

/* Bitfield definition for register of struct array CTRL: MAX */
/*
 * CMD_MAX (RW)
 *
 * maximum command value
 */
#define SEI_CTRL_CMD_TABLE_MAX_CMD_MAX_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_CMD_TABLE_MAX_CMD_MAX_SHIFT (0U)
#define SEI_CTRL_CMD_TABLE_MAX_CMD_MAX_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_MAX_CMD_MAX_SHIFT) & SEI_CTRL_CMD_TABLE_MAX_CMD_MAX_MASK)
#define SEI_CTRL_CMD_TABLE_MAX_CMD_MAX_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_MAX_CMD_MAX_MASK) >> SEI_CTRL_CMD_TABLE_MAX_CMD_MAX_SHIFT)

/* Bitfield definition for register of struct array CTRL: MSK */
/*
 * CMD_MASK (RW)
 *
 * compare mask
 */
#define SEI_CTRL_CMD_TABLE_MSK_CMD_MASK_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_CMD_TABLE_MSK_CMD_MASK_SHIFT (0U)
#define SEI_CTRL_CMD_TABLE_MSK_CMD_MASK_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_MSK_CMD_MASK_SHIFT) & SEI_CTRL_CMD_TABLE_MSK_CMD_MASK_MASK)
#define SEI_CTRL_CMD_TABLE_MSK_CMD_MASK_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_MSK_CMD_MASK_MASK) >> SEI_CTRL_CMD_TABLE_MSK_CMD_MASK_SHIFT)

/* Bitfield definition for register of struct array CTRL: PTA */
/*
 * PTR3 (RW)
 *
 * pointer3
 */
#define SEI_CTRL_CMD_TABLE_PTA_PTR3_MASK (0xFF000000UL)
#define SEI_CTRL_CMD_TABLE_PTA_PTR3_SHIFT (24U)
#define SEI_CTRL_CMD_TABLE_PTA_PTR3_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTA_PTR3_SHIFT) & SEI_CTRL_CMD_TABLE_PTA_PTR3_MASK)
#define SEI_CTRL_CMD_TABLE_PTA_PTR3_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTA_PTR3_MASK) >> SEI_CTRL_CMD_TABLE_PTA_PTR3_SHIFT)

/*
 * PTR2 (RW)
 *
 * pointer2
 */
#define SEI_CTRL_CMD_TABLE_PTA_PTR2_MASK (0xFF0000UL)
#define SEI_CTRL_CMD_TABLE_PTA_PTR2_SHIFT (16U)
#define SEI_CTRL_CMD_TABLE_PTA_PTR2_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTA_PTR2_SHIFT) & SEI_CTRL_CMD_TABLE_PTA_PTR2_MASK)
#define SEI_CTRL_CMD_TABLE_PTA_PTR2_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTA_PTR2_MASK) >> SEI_CTRL_CMD_TABLE_PTA_PTR2_SHIFT)

/*
 * PTR1 (RW)
 *
 * pointer1
 */
#define SEI_CTRL_CMD_TABLE_PTA_PTR1_MASK (0xFF00U)
#define SEI_CTRL_CMD_TABLE_PTA_PTR1_SHIFT (8U)
#define SEI_CTRL_CMD_TABLE_PTA_PTR1_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTA_PTR1_SHIFT) & SEI_CTRL_CMD_TABLE_PTA_PTR1_MASK)
#define SEI_CTRL_CMD_TABLE_PTA_PTR1_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTA_PTR1_MASK) >> SEI_CTRL_CMD_TABLE_PTA_PTR1_SHIFT)

/*
 * PTR0 (RW)
 *
 * pointer0
 */
#define SEI_CTRL_CMD_TABLE_PTA_PTR0_MASK (0xFFU)
#define SEI_CTRL_CMD_TABLE_PTA_PTR0_SHIFT (0U)
#define SEI_CTRL_CMD_TABLE_PTA_PTR0_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTA_PTR0_SHIFT) & SEI_CTRL_CMD_TABLE_PTA_PTR0_MASK)
#define SEI_CTRL_CMD_TABLE_PTA_PTR0_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTA_PTR0_MASK) >> SEI_CTRL_CMD_TABLE_PTA_PTR0_SHIFT)

/* Bitfield definition for register of struct array CTRL: PTB */
/*
 * PTR7 (RW)
 *
 * pointer7
 */
#define SEI_CTRL_CMD_TABLE_PTB_PTR7_MASK (0xFF000000UL)
#define SEI_CTRL_CMD_TABLE_PTB_PTR7_SHIFT (24U)
#define SEI_CTRL_CMD_TABLE_PTB_PTR7_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTB_PTR7_SHIFT) & SEI_CTRL_CMD_TABLE_PTB_PTR7_MASK)
#define SEI_CTRL_CMD_TABLE_PTB_PTR7_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTB_PTR7_MASK) >> SEI_CTRL_CMD_TABLE_PTB_PTR7_SHIFT)

/*
 * PTR6 (RW)
 *
 * pointer6
 */
#define SEI_CTRL_CMD_TABLE_PTB_PTR6_MASK (0xFF0000UL)
#define SEI_CTRL_CMD_TABLE_PTB_PTR6_SHIFT (16U)
#define SEI_CTRL_CMD_TABLE_PTB_PTR6_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTB_PTR6_SHIFT) & SEI_CTRL_CMD_TABLE_PTB_PTR6_MASK)
#define SEI_CTRL_CMD_TABLE_PTB_PTR6_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTB_PTR6_MASK) >> SEI_CTRL_CMD_TABLE_PTB_PTR6_SHIFT)

/*
 * PTR5 (RW)
 *
 * pointer5
 */
#define SEI_CTRL_CMD_TABLE_PTB_PTR5_MASK (0xFF00U)
#define SEI_CTRL_CMD_TABLE_PTB_PTR5_SHIFT (8U)
#define SEI_CTRL_CMD_TABLE_PTB_PTR5_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTB_PTR5_SHIFT) & SEI_CTRL_CMD_TABLE_PTB_PTR5_MASK)
#define SEI_CTRL_CMD_TABLE_PTB_PTR5_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTB_PTR5_MASK) >> SEI_CTRL_CMD_TABLE_PTB_PTR5_SHIFT)

/*
 * PTR4 (RW)
 *
 * pointer4
 */
#define SEI_CTRL_CMD_TABLE_PTB_PTR4_MASK (0xFFU)
#define SEI_CTRL_CMD_TABLE_PTB_PTR4_SHIFT (0U)
#define SEI_CTRL_CMD_TABLE_PTB_PTR4_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTB_PTR4_SHIFT) & SEI_CTRL_CMD_TABLE_PTB_PTR4_MASK)
#define SEI_CTRL_CMD_TABLE_PTB_PTR4_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTB_PTR4_MASK) >> SEI_CTRL_CMD_TABLE_PTB_PTR4_SHIFT)

/* Bitfield definition for register of struct array CTRL: PTC */
/*
 * PTR11 (RW)
 *
 * pointer11
 */
#define SEI_CTRL_CMD_TABLE_PTC_PTR11_MASK (0xFF000000UL)
#define SEI_CTRL_CMD_TABLE_PTC_PTR11_SHIFT (24U)
#define SEI_CTRL_CMD_TABLE_PTC_PTR11_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTC_PTR11_SHIFT) & SEI_CTRL_CMD_TABLE_PTC_PTR11_MASK)
#define SEI_CTRL_CMD_TABLE_PTC_PTR11_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTC_PTR11_MASK) >> SEI_CTRL_CMD_TABLE_PTC_PTR11_SHIFT)

