hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_sei_regs.h
/*
 * PTR0_ST (W1C)
 *
 * Pointer 0 start
 */
#define SEI_CTRL_IRQ_INT_FLAG_PTR0_ST_MASK (0x10U)
#define SEI_CTRL_IRQ_INT_FLAG_PTR0_ST_SHIFT (4U)
#define SEI_CTRL_IRQ_INT_FLAG_PTR0_ST_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_PTR0_ST_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_PTR0_ST_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_PTR0_ST_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_PTR0_ST_MASK) >> SEI_CTRL_IRQ_INT_FLAG_PTR0_ST_SHIFT)

/*
 * WDOG (W1C)
 *
 * Watch dog
 */
#define SEI_CTRL_IRQ_INT_FLAG_WDOG_MASK (0x4U)
#define SEI_CTRL_IRQ_INT_FLAG_WDOG_SHIFT (2U)
#define SEI_CTRL_IRQ_INT_FLAG_WDOG_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_WDOG_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_WDOG_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_WDOG_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_WDOG_MASK) >> SEI_CTRL_IRQ_INT_FLAG_WDOG_SHIFT)

/*
 * EXECPT (W1C)
 *
 * Exception
 */
#define SEI_CTRL_IRQ_INT_FLAG_EXECPT_MASK (0x2U)
#define SEI_CTRL_IRQ_INT_FLAG_EXECPT_SHIFT (1U)
#define SEI_CTRL_IRQ_INT_FLAG_EXECPT_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_EXECPT_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_EXECPT_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_EXECPT_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_EXECPT_MASK) >> SEI_CTRL_IRQ_INT_FLAG_EXECPT_SHIFT)

/*
 * STALL (W1C)
 *
 * Stall
 */
#define SEI_CTRL_IRQ_INT_FLAG_STALL_MASK (0x1U)
#define SEI_CTRL_IRQ_INT_FLAG_STALL_SHIFT (0U)
#define SEI_CTRL_IRQ_INT_FLAG_STALL_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_STALL_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_STALL_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_STALL_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_STALL_MASK) >> SEI_CTRL_IRQ_INT_FLAG_STALL_SHIFT)

/* Bitfield definition for register of struct array CTRL: INT_STS */
/*
 * TRG_ERR3 (RO)
 *
 * Trigger3 failed
 */
#define SEI_CTRL_IRQ_INT_STS_TRG_ERR3_MASK (0x80000000UL)
#define SEI_CTRL_IRQ_INT_STS_TRG_ERR3_SHIFT (31U)
#define SEI_CTRL_IRQ_INT_STS_TRG_ERR3_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_TRG_ERR3_MASK) >> SEI_CTRL_IRQ_INT_STS_TRG_ERR3_SHIFT)

/*
 * TRG_ERR2 (RO)
 *
 * Trigger2 failed
 */
#define SEI_CTRL_IRQ_INT_STS_TRG_ERR2_MASK (0x40000000UL)
#define SEI_CTRL_IRQ_INT_STS_TRG_ERR2_SHIFT (30U)
#define SEI_CTRL_IRQ_INT_STS_TRG_ERR2_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_TRG_ERR2_MASK) >> SEI_CTRL_IRQ_INT_STS_TRG_ERR2_SHIFT)

/*
 * TRG_ERR1 (RO)
 *
 * Trigger1 failed
 */
#define SEI_CTRL_IRQ_INT_STS_TRG_ERR1_MASK (0x20000000UL)
#define SEI_CTRL_IRQ_INT_STS_TRG_ERR1_SHIFT (29U)
#define SEI_CTRL_IRQ_INT_STS_TRG_ERR1_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_TRG_ERR1_MASK) >> SEI_CTRL_IRQ_INT_STS_TRG_ERR1_SHIFT)

/*
 * TRG_ERR0 (RO)
 *
 * Trigger0 failed
 */
#define SEI_CTRL_IRQ_INT_STS_TRG_ERR0_MASK (0x10000000UL)
#define SEI_CTRL_IRQ_INT_STS_TRG_ERR0_SHIFT (28U)
#define SEI_CTRL_IRQ_INT_STS_TRG_ERR0_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_TRG_ERR0_MASK) >> SEI_CTRL_IRQ_INT_STS_TRG_ERR0_SHIFT)

/*
 * TRIGER3 (RO)
 *
 * Trigger3
 */
#define SEI_CTRL_IRQ_INT_STS_TRIGER3_MASK (0x8000000UL)
#define SEI_CTRL_IRQ_INT_STS_TRIGER3_SHIFT (27U)
#define SEI_CTRL_IRQ_INT_STS_TRIGER3_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_TRIGER3_MASK) >> SEI_CTRL_IRQ_INT_STS_TRIGER3_SHIFT)

/*
 * TRIGER2 (RO)
 *
 * Trigger2
 */
#define SEI_CTRL_IRQ_INT_STS_TRIGER2_MASK (0x4000000UL)
#define SEI_CTRL_IRQ_INT_STS_TRIGER2_SHIFT (26U)
#define SEI_CTRL_IRQ_INT_STS_TRIGER2_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_TRIGER2_MASK) >> SEI_CTRL_IRQ_INT_STS_TRIGER2_SHIFT)

/*
 * TRIGER1 (RO)
 *
 * Trigger1
 */
#define SEI_CTRL_IRQ_INT_STS_TRIGER1_MASK (0x2000000UL)
#define SEI_CTRL_IRQ_INT_STS_TRIGER1_SHIFT (25U)
#define SEI_CTRL_IRQ_INT_STS_TRIGER1_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_TRIGER1_MASK) >> SEI_CTRL_IRQ_INT_STS_TRIGER1_SHIFT)

/*
 * TRIGER0 (RO)
 *
 * Trigger0
 */
#define SEI_CTRL_IRQ_INT_STS_TRIGER0_MASK (0x1000000UL)
#define SEI_CTRL_IRQ_INT_STS_TRIGER0_SHIFT (24U)
#define SEI_CTRL_IRQ_INT_STS_TRIGER0_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_TRIGER0_MASK) >> SEI_CTRL_IRQ_INT_STS_TRIGER0_SHIFT)

/*
 * SMP_ERR (RO)
 *
 * Sample error
 */
#define SEI_CTRL_IRQ_INT_STS_SMP_ERR_MASK (0x100000UL)
#define SEI_CTRL_IRQ_INT_STS_SMP_ERR_SHIFT (20U)
#define SEI_CTRL_IRQ_INT_STS_SMP_ERR_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_SMP_ERR_MASK) >> SEI_CTRL_IRQ_INT_STS_SMP_ERR_SHIFT)

/*
 * LATCH3 (RO)
 *
 * Latch3
 */
#define SEI_CTRL_IRQ_INT_STS_LATCH3_MASK (0x80000UL)
#define SEI_CTRL_IRQ_INT_STS_LATCH3_SHIFT (19U)
#define SEI_CTRL_IRQ_INT_STS_LATCH3_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_LATCH3_MASK) >> SEI_CTRL_IRQ_INT_STS_LATCH3_SHIFT)

/*
 * LATCH2 (RO)
 *
 * Latch2
 */
#define SEI_CTRL_IRQ_INT_STS_LATCH2_MASK (0x40000UL)
#define SEI_CTRL_IRQ_INT_STS_LATCH2_SHIFT (18U)
#define SEI_CTRL_IRQ_INT_STS_LATCH2_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_LATCH2_MASK) >> SEI_CTRL_IRQ_INT_STS_LATCH2_SHIFT)

/*
 * LATCH1 (RO)
 *
 * Latch1
 */
#define SEI_CTRL_IRQ_INT_STS_LATCH1_MASK (0x20000UL)
#define SEI_CTRL_IRQ_INT_STS_LATCH1_SHIFT (17U)
#define SEI_CTRL_IRQ_INT_STS_LATCH1_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_LATCH1_MASK) >> SEI_CTRL_IRQ_INT_STS_LATCH1_SHIFT)

/*
 * LATCH0 (RO)
 *
 * Latch0
 */
#define SEI_CTRL_IRQ_INT_STS_LATCH0_MASK (0x10000UL)
#define SEI_CTRL_IRQ_INT_STS_LATCH0_SHIFT (16U)
#define SEI_CTRL_IRQ_INT_STS_LATCH0_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_LATCH0_MASK) >> SEI_CTRL_IRQ_INT_STS_LATCH0_SHIFT)

/*
 * TIMEOUT (RO)
 *
 * Timeout
 */
#define SEI_CTRL_IRQ_INT_STS_TIMEOUT_MASK (0x2000U)
#define SEI_CTRL_IRQ_INT_STS_TIMEOUT_SHIFT (13U)
#define SEI_CTRL_IRQ_INT_STS_TIMEOUT_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_TIMEOUT_MASK) >> SEI_CTRL_IRQ_INT_STS_TIMEOUT_SHIFT)

/*
 * TRX_ERR (RO)
 *
 * Transfer error
 */
#define SEI_CTRL_IRQ_INT_STS_TRX_ERR_MASK (0x1000U)
#define SEI_CTRL_IRQ_INT_STS_TRX_ERR_SHIFT (12U)
#define SEI_CTRL_IRQ_INT_STS_TRX_ERR_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_TRX_ERR_MASK) >> SEI_CTRL_IRQ_INT_STS_TRX_ERR_SHIFT)

