hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_sei_regs.h
/*
 * MAX_BIT (RW)
 *
 * Highest bit index
 */
#define SEI_DAT_IDX_MAX_BIT_MASK (0x1F00U)
#define SEI_DAT_IDX_MAX_BIT_SHIFT (8U)
#define SEI_DAT_IDX_MAX_BIT_SET(x) (((uint32_t)(x) << SEI_DAT_IDX_MAX_BIT_SHIFT) & SEI_DAT_IDX_MAX_BIT_MASK)
#define SEI_DAT_IDX_MAX_BIT_GET(x) (((uint32_t)(x) & SEI_DAT_IDX_MAX_BIT_MASK) >> SEI_DAT_IDX_MAX_BIT_SHIFT)

/*
 * MIN_BIT (RW)
 *
 * Lowest bit index
 */
#define SEI_DAT_IDX_MIN_BIT_MASK (0x1FU)
#define SEI_DAT_IDX_MIN_BIT_SHIFT (0U)
#define SEI_DAT_IDX_MIN_BIT_SET(x) (((uint32_t)(x) << SEI_DAT_IDX_MIN_BIT_SHIFT) & SEI_DAT_IDX_MIN_BIT_MASK)
#define SEI_DAT_IDX_MIN_BIT_GET(x) (((uint32_t)(x) & SEI_DAT_IDX_MIN_BIT_MASK) >> SEI_DAT_IDX_MIN_BIT_SHIFT)

/* Bitfield definition for register of struct array DAT: GOLD */
/*
 * GOLD_VALUE (RW)
 *
 * Gold value for check mode
 */
#define SEI_DAT_GOLD_GOLD_VALUE_MASK (0xFFFFFFFFUL)
#define SEI_DAT_GOLD_GOLD_VALUE_SHIFT (0U)
#define SEI_DAT_GOLD_GOLD_VALUE_SET(x) (((uint32_t)(x) << SEI_DAT_GOLD_GOLD_VALUE_SHIFT) & SEI_DAT_GOLD_GOLD_VALUE_MASK)
#define SEI_DAT_GOLD_GOLD_VALUE_GET(x) (((uint32_t)(x) & SEI_DAT_GOLD_GOLD_VALUE_MASK) >> SEI_DAT_GOLD_GOLD_VALUE_SHIFT)

/* Bitfield definition for register of struct array DAT: CRCINIT */
/*
 * CRC_INIT (RW)
 *
 * CRC initial value
 */
#define SEI_DAT_CRCINIT_CRC_INIT_MASK (0xFFFFFFFFUL)
#define SEI_DAT_CRCINIT_CRC_INIT_SHIFT (0U)
#define SEI_DAT_CRCINIT_CRC_INIT_SET(x) (((uint32_t)(x) << SEI_DAT_CRCINIT_CRC_INIT_SHIFT) & SEI_DAT_CRCINIT_CRC_INIT_MASK)
#define SEI_DAT_CRCINIT_CRC_INIT_GET(x) (((uint32_t)(x) & SEI_DAT_CRCINIT_CRC_INIT_MASK) >> SEI_DAT_CRCINIT_CRC_INIT_SHIFT)

/* Bitfield definition for register of struct array DAT: CRCPOLY */
/*
 * CRC_POLY (RW)
 *
 * CRC polymonial
 */
#define SEI_DAT_CRCPOLY_CRC_POLY_MASK (0xFFFFFFFFUL)
#define SEI_DAT_CRCPOLY_CRC_POLY_SHIFT (0U)
#define SEI_DAT_CRCPOLY_CRC_POLY_SET(x) (((uint32_t)(x) << SEI_DAT_CRCPOLY_CRC_POLY_SHIFT) & SEI_DAT_CRCPOLY_CRC_POLY_MASK)
#define SEI_DAT_CRCPOLY_CRC_POLY_GET(x) (((uint32_t)(x) & SEI_DAT_CRCPOLY_CRC_POLY_MASK) >> SEI_DAT_CRCPOLY_CRC_POLY_SHIFT)

/* Bitfield definition for register of struct array DAT: DATA */
/*
 * DATA (RW)
 *
 * DATA
 */
#define SEI_DAT_DATA_DATA_MASK (0xFFFFFFFFUL)
#define SEI_DAT_DATA_DATA_SHIFT (0U)
#define SEI_DAT_DATA_DATA_SET(x) (((uint32_t)(x) << SEI_DAT_DATA_DATA_SHIFT) & SEI_DAT_DATA_DATA_MASK)
#define SEI_DAT_DATA_DATA_GET(x) (((uint32_t)(x) & SEI_DAT_DATA_DATA_MASK) >> SEI_DAT_DATA_DATA_SHIFT)

/* Bitfield definition for register of struct array DAT: SET */
/*
 * DATA_SET (RW)
 *
 * DATA bit set
 */
#define SEI_DAT_SET_DATA_SET_MASK (0xFFFFFFFFUL)
#define SEI_DAT_SET_DATA_SET_SHIFT (0U)
#define SEI_DAT_SET_DATA_SET_SET(x) (((uint32_t)(x) << SEI_DAT_SET_DATA_SET_SHIFT) & SEI_DAT_SET_DATA_SET_MASK)
#define SEI_DAT_SET_DATA_SET_GET(x) (((uint32_t)(x) & SEI_DAT_SET_DATA_SET_MASK) >> SEI_DAT_SET_DATA_SET_SHIFT)

/* Bitfield definition for register of struct array DAT: CLR */
/*
 * DATA_CLR (RW)
 *
 * DATA bit clear
 */
#define SEI_DAT_CLR_DATA_CLR_MASK (0xFFFFFFFFUL)
#define SEI_DAT_CLR_DATA_CLR_SHIFT (0U)
#define SEI_DAT_CLR_DATA_CLR_SET(x) (((uint32_t)(x) << SEI_DAT_CLR_DATA_CLR_SHIFT) & SEI_DAT_CLR_DATA_CLR_MASK)
#define SEI_DAT_CLR_DATA_CLR_GET(x) (((uint32_t)(x) & SEI_DAT_CLR_DATA_CLR_MASK) >> SEI_DAT_CLR_DATA_CLR_SHIFT)

/* Bitfield definition for register of struct array DAT: INV */
/*
 * DATA_INV (RW)
 *
 * DATA bit toggle
 */
#define SEI_DAT_INV_DATA_INV_MASK (0xFFFFFFFFUL)
#define SEI_DAT_INV_DATA_INV_SHIFT (0U)
#define SEI_DAT_INV_DATA_INV_SET(x) (((uint32_t)(x) << SEI_DAT_INV_DATA_INV_SHIFT) & SEI_DAT_INV_DATA_INV_MASK)
#define SEI_DAT_INV_DATA_INV_GET(x) (((uint32_t)(x) & SEI_DAT_INV_DATA_INV_MASK) >> SEI_DAT_INV_DATA_INV_SHIFT)

/* Bitfield definition for register of struct array DAT: IN */
/*
 * DATA_IN (RO)
 *
 * Data input
 */
#define SEI_DAT_IN_DATA_IN_MASK (0xFFFFFFFFUL)
#define SEI_DAT_IN_DATA_IN_SHIFT (0U)
#define SEI_DAT_IN_DATA_IN_GET(x) (((uint32_t)(x) & SEI_DAT_IN_DATA_IN_MASK) >> SEI_DAT_IN_DATA_IN_SHIFT)

/* Bitfield definition for register of struct array DAT: OUT */
/*
 * DATA_OUT (RO)
 *
 * Data output
 */
#define SEI_DAT_OUT_DATA_OUT_MASK (0xFFFFFFFFUL)
#define SEI_DAT_OUT_DATA_OUT_SHIFT (0U)
#define SEI_DAT_OUT_DATA_OUT_GET(x) (((uint32_t)(x) & SEI_DAT_OUT_DATA_OUT_MASK) >> SEI_DAT_OUT_DATA_OUT_SHIFT)

/* Bitfield definition for register of struct array DAT: STS */
/*
 * CRC_IDX (RO)
 *
 * CRC index
 */
#define SEI_DAT_STS_CRC_IDX_MASK (0x1F000000UL)
#define SEI_DAT_STS_CRC_IDX_SHIFT (24U)
#define SEI_DAT_STS_CRC_IDX_GET(x) (((uint32_t)(x) & SEI_DAT_STS_CRC_IDX_MASK) >> SEI_DAT_STS_CRC_IDX_SHIFT)

/*
 * WORD_IDX (RO)
 *
 * Word index
 */
#define SEI_DAT_STS_WORD_IDX_MASK (0x1F0000UL)
#define SEI_DAT_STS_WORD_IDX_SHIFT (16U)
#define SEI_DAT_STS_WORD_IDX_GET(x) (((uint32_t)(x) & SEI_DAT_STS_WORD_IDX_MASK) >> SEI_DAT_STS_WORD_IDX_SHIFT)

/*
 * WORD_CNT (RO)
 *
 * Word counter
 */
#define SEI_DAT_STS_WORD_CNT_MASK (0x1F00U)
#define SEI_DAT_STS_WORD_CNT_SHIFT (8U)
#define SEI_DAT_STS_WORD_CNT_GET(x) (((uint32_t)(x) & SEI_DAT_STS_WORD_CNT_MASK) >> SEI_DAT_STS_WORD_CNT_SHIFT)

/*
 * BIT_IDX (RO)
 *
 * Bit index
 */
#define SEI_DAT_STS_BIT_IDX_MASK (0x1FU)
#define SEI_DAT_STS_BIT_IDX_SHIFT (0U)
#define SEI_DAT_STS_BIT_IDX_GET(x) (((uint32_t)(x) & SEI_DAT_STS_BIT_IDX_MASK) >> SEI_DAT_STS_BIT_IDX_SHIFT)



/* CMD register group index macro definition */
#define SEI_CTRL_TRG_TABLE_CMD_0 (0UL)
#define SEI_CTRL_TRG_TABLE_CMD_1 (1UL)
#define SEI_CTRL_TRG_TABLE_CMD_2 (2UL)
#define SEI_CTRL_TRG_TABLE_CMD_3 (3UL)

/* TIME register group index macro definition */
#define SEI_CTRL_TRG_TABLE_TIME_0 (0UL)
#define SEI_CTRL_TRG_TABLE_TIME_1 (1UL)
#define SEI_CTRL_TRG_TABLE_TIME_2 (2UL)
#define SEI_CTRL_TRG_TABLE_TIME_3 (3UL)

/* CMD_TABLE register group index macro definition */
#define SEI_CMD_TABLE_0 (0UL)
#define SEI_CMD_TABLE_1 (1UL)
#define SEI_CMD_TABLE_2 (2UL)
#define SEI_CMD_TABLE_3 (3UL)
#define SEI_CMD_TABLE_4 (4UL)
#define SEI_CMD_TABLE_5 (5UL)
#define SEI_CMD_TABLE_6 (6UL)
#define SEI_CMD_TABLE_7 (7UL)

