hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_sei_regs.h
/* TRAN register group index macro definition */
#define SEI_CTRL_LATCH_TRAN_0_1 (0UL)
#define SEI_CTRL_LATCH_TRAN_1_2 (1UL)
#define SEI_CTRL_LATCH_TRAN_2_3 (2UL)
#define SEI_CTRL_LATCH_TRAN_3_0 (3UL)

/* LATCH register group index macro definition */
#define SEI_LATCH_0 (0UL)
#define SEI_LATCH_1 (1UL)
#define SEI_LATCH_2 (2UL)
#define SEI_LATCH_3 (3UL)

/* CTRL register group index macro definition */
#define SEI_CTRL_0 (0UL)
#define SEI_CTRL_1 (1UL)
#define SEI_CTRL_2 (2UL)
#define SEI_CTRL_3 (3UL)
#define SEI_CTRL_4 (4UL)
#define SEI_CTRL_5 (5UL)
#define SEI_CTRL_6 (6UL)
#define SEI_CTRL_7 (7UL)
#define SEI_CTRL_8 (8UL)
#define SEI_CTRL_9 (9UL)
#define SEI_CTRL_10 (10UL)
#define SEI_CTRL_11 (11UL)
#define SEI_CTRL_12 (12UL)

/* INSTR register group index macro definition */
#define SEI_INSTR_0 (0UL)
#define SEI_INSTR_1 (1UL)
#define SEI_INSTR_2 (2UL)
#define SEI_INSTR_3 (3UL)
#define SEI_INSTR_4 (4UL)
#define SEI_INSTR_5 (5UL)
#define SEI_INSTR_6 (6UL)
#define SEI_INSTR_7 (7UL)
#define SEI_INSTR_8 (8UL)
#define SEI_INSTR_9 (9UL)
#define SEI_INSTR_10 (10UL)
#define SEI_INSTR_11 (11UL)
#define SEI_INSTR_12 (12UL)
#define SEI_INSTR_13 (13UL)
#define SEI_INSTR_14 (14UL)
#define SEI_INSTR_15 (15UL)
#define SEI_INSTR_16 (16UL)
#define SEI_INSTR_17 (17UL)
#define SEI_INSTR_18 (18UL)
#define SEI_INSTR_19 (19UL)
#define SEI_INSTR_20 (20UL)
#define SEI_INSTR_21 (21UL)
#define SEI_INSTR_22 (22UL)
#define SEI_INSTR_23 (23UL)
#define SEI_INSTR_24 (24UL)
#define SEI_INSTR_25 (25UL)
#define SEI_INSTR_26 (26UL)
#define SEI_INSTR_27 (27UL)
#define SEI_INSTR_28 (28UL)
#define SEI_INSTR_29 (29UL)
#define SEI_INSTR_30 (30UL)
#define SEI_INSTR_31 (31UL)
#define SEI_INSTR_32 (32UL)
#define SEI_INSTR_33 (33UL)
#define SEI_INSTR_34 (34UL)
#define SEI_INSTR_35 (35UL)
#define SEI_INSTR_36 (36UL)
#define SEI_INSTR_37 (37UL)
#define SEI_INSTR_38 (38UL)
#define SEI_INSTR_39 (39UL)
#define SEI_INSTR_40 (40UL)
#define SEI_INSTR_41 (41UL)
#define SEI_INSTR_42 (42UL)
#define SEI_INSTR_43 (43UL)
#define SEI_INSTR_44 (44UL)
#define SEI_INSTR_45 (45UL)
#define SEI_INSTR_46 (46UL)
#define SEI_INSTR_47 (47UL)
#define SEI_INSTR_48 (48UL)
#define SEI_INSTR_49 (49UL)
#define SEI_INSTR_50 (50UL)
#define SEI_INSTR_51 (51UL)
#define SEI_INSTR_52 (52UL)
#define SEI_INSTR_53 (53UL)
#define SEI_INSTR_54 (54UL)
#define SEI_INSTR_55 (55UL)
#define SEI_INSTR_56 (56UL)
#define SEI_INSTR_57 (57UL)
#define SEI_INSTR_58 (58UL)
#define SEI_INSTR_59 (59UL)
#define SEI_INSTR_60 (60UL)
#define SEI_INSTR_61 (61UL)
#define SEI_INSTR_62 (62UL)
#define SEI_INSTR_63 (63UL)
#define SEI_INSTR_64 (64UL)
#define SEI_INSTR_65 (65UL)
#define SEI_INSTR_66 (66UL)
#define SEI_INSTR_67 (67UL)
#define SEI_INSTR_68 (68UL)
#define SEI_INSTR_69 (69UL)
#define SEI_INSTR_70 (70UL)
#define SEI_INSTR_71 (71UL)
#define SEI_INSTR_72 (72UL)
#define SEI_INSTR_73 (73UL)
#define SEI_INSTR_74 (74UL)
#define SEI_INSTR_75 (75UL)
#define SEI_INSTR_76 (76UL)
#define SEI_INSTR_77 (77UL)
#define SEI_INSTR_78 (78UL)
#define SEI_INSTR_79 (79UL)
#define SEI_INSTR_80 (80UL)
#define SEI_INSTR_81 (81UL)
#define SEI_INSTR_82 (82UL)
#define SEI_INSTR_83 (83UL)
#define SEI_INSTR_84 (84UL)
#define SEI_INSTR_85 (85UL)
#define SEI_INSTR_86 (86UL)
#define SEI_INSTR_87 (87UL)
#define SEI_INSTR_88 (88UL)
#define SEI_INSTR_89 (89UL)
#define SEI_INSTR_90 (90UL)
#define SEI_INSTR_91 (91UL)
#define SEI_INSTR_92 (92UL)
#define SEI_INSTR_93 (93UL)
#define SEI_INSTR_94 (94UL)
#define SEI_INSTR_95 (95UL)
#define SEI_INSTR_96 (96UL)
#define SEI_INSTR_97 (97UL)
#define SEI_INSTR_98 (98UL)
#define SEI_INSTR_99 (99UL)
#define SEI_INSTR_100 (100UL)
#define SEI_INSTR_101 (101UL)
#define SEI_INSTR_102 (102UL)
#define SEI_INSTR_103 (103UL)
#define SEI_INSTR_104 (104UL)
#define SEI_INSTR_105 (105UL)
#define SEI_INSTR_106 (106UL)
#define SEI_INSTR_107 (107UL)
#define SEI_INSTR_108 (108UL)
#define SEI_INSTR_109 (109UL)
#define SEI_INSTR_110 (110UL)
#define SEI_INSTR_111 (111UL)
#define SEI_INSTR_112 (112UL)
#define SEI_INSTR_113 (113UL)
#define SEI_INSTR_114 (114UL)
#define SEI_INSTR_115 (115UL)
#define SEI_INSTR_116 (116UL)
#define SEI_INSTR_117 (117UL)
#define SEI_INSTR_118 (118UL)
#define SEI_INSTR_119 (119UL)
#define SEI_INSTR_120 (120UL)
#define SEI_INSTR_121 (121UL)
#define SEI_INSTR_122 (122UL)
#define SEI_INSTR_123 (123UL)
#define SEI_INSTR_124 (124UL)
#define SEI_INSTR_125 (125UL)
#define SEI_INSTR_126 (126UL)
#define SEI_INSTR_127 (127UL)
#define SEI_INSTR_128 (128UL)
#define SEI_INSTR_129 (129UL)
#define SEI_INSTR_130 (130UL)
#define SEI_INSTR_131 (131UL)
#define SEI_INSTR_132 (132UL)
#define SEI_INSTR_133 (133UL)
#define SEI_INSTR_134 (134UL)
#define SEI_INSTR_135 (135UL)
#define SEI_INSTR_136 (136UL)
#define SEI_INSTR_137 (137UL)
#define SEI_INSTR_138 (138UL)
#define SEI_INSTR_139 (139UL)
#define SEI_INSTR_140 (140UL)
#define SEI_INSTR_141 (141UL)
#define SEI_INSTR_142 (142UL)
#define SEI_INSTR_143 (143UL)
#define SEI_INSTR_144 (144UL)
#define SEI_INSTR_145 (145UL)
#define SEI_INSTR_146 (146UL)
#define SEI_INSTR_147 (147UL)
#define SEI_INSTR_148 (148UL)
#define SEI_INSTR_149 (149UL)
#define SEI_INSTR_150 (150UL)
#define SEI_INSTR_151 (151UL)
#define SEI_INSTR_152 (152UL)
#define SEI_INSTR_153 (153UL)
#define SEI_INSTR_154 (154UL)
#define SEI_INSTR_155 (155UL)
#define SEI_INSTR_156 (156UL)
#define SEI_INSTR_157 (157UL)
#define SEI_INSTR_158 (158UL)
#define SEI_INSTR_159 (159UL)
#define SEI_INSTR_160 (160UL)
#define SEI_INSTR_161 (161UL)
#define SEI_INSTR_162 (162UL)
#define SEI_INSTR_163 (163UL)
#define SEI_INSTR_164 (164UL)
#define SEI_INSTR_165 (165UL)
#define SEI_INSTR_166 (166UL)
#define SEI_INSTR_167 (167UL)
#define SEI_INSTR_168 (168UL)
#define SEI_INSTR_169 (169UL)
#define SEI_INSTR_170 (170UL)
#define SEI_INSTR_171 (171UL)
#define SEI_INSTR_172 (172UL)
#define SEI_INSTR_173 (173UL)
#define SEI_INSTR_174 (174UL)
#define SEI_INSTR_175 (175UL)
#define SEI_INSTR_176 (176UL)
#define SEI_INSTR_177 (177UL)
#define SEI_INSTR_178 (178UL)
#define SEI_INSTR_179 (179UL)
#define SEI_INSTR_180 (180UL)
#define SEI_INSTR_181 (181UL)
#define SEI_INSTR_182 (182UL)
#define SEI_INSTR_183 (183UL)
#define SEI_INSTR_184 (184UL)
#define SEI_INSTR_185 (185UL)
#define SEI_INSTR_186 (186UL)
#define SEI_INSTR_187 (187UL)
#define SEI_INSTR_188 (188UL)
#define SEI_INSTR_189 (189UL)
#define SEI_INSTR_190 (190UL)
#define SEI_INSTR_191 (191UL)
#define SEI_INSTR_192 (192UL)
#define SEI_INSTR_193 (193UL)
#define SEI_INSTR_194 (194UL)
#define SEI_INSTR_195 (195UL)
#define SEI_INSTR_196 (196UL)
#define SEI_INSTR_197 (197UL)
#define SEI_INSTR_198 (198UL)
#define SEI_INSTR_199 (199UL)
#define SEI_INSTR_200 (200UL)
#define SEI_INSTR_201 (201UL)
#define SEI_INSTR_202 (202UL)
#define SEI_INSTR_203 (203UL)
#define SEI_INSTR_204 (204UL)
#define SEI_INSTR_205 (205UL)
#define SEI_INSTR_206 (206UL)
#define SEI_INSTR_207 (207UL)
#define SEI_INSTR_208 (208UL)
#define SEI_INSTR_209 (209UL)
#define SEI_INSTR_210 (210UL)
#define SEI_INSTR_211 (211UL)
#define SEI_INSTR_212 (212UL)
#define SEI_INSTR_213 (213UL)
#define SEI_INSTR_214 (214UL)
#define SEI_INSTR_215 (215UL)
#define SEI_INSTR_216 (216UL)
#define SEI_INSTR_217 (217UL)
#define SEI_INSTR_218 (218UL)
#define SEI_INSTR_219 (219UL)
#define SEI_INSTR_220 (220UL)
#define SEI_INSTR_221 (221UL)
#define SEI_INSTR_222 (222UL)
#define SEI_INSTR_223 (223UL)
#define SEI_INSTR_224 (224UL)
#define SEI_INSTR_225 (225UL)
#define SEI_INSTR_226 (226UL)
#define SEI_INSTR_227 (227UL)
#define SEI_INSTR_228 (228UL)
#define SEI_INSTR_229 (229UL)
#define SEI_INSTR_230 (230UL)
#define SEI_INSTR_231 (231UL)
#define SEI_INSTR_232 (232UL)
#define SEI_INSTR_233 (233UL)
#define SEI_INSTR_234 (234UL)
#define SEI_INSTR_235 (235UL)
#define SEI_INSTR_236 (236UL)
#define SEI_INSTR_237 (237UL)
#define SEI_INSTR_238 (238UL)
#define SEI_INSTR_239 (239UL)
#define SEI_INSTR_240 (240UL)
#define SEI_INSTR_241 (241UL)
#define SEI_INSTR_242 (242UL)
#define SEI_INSTR_243 (243UL)
#define SEI_INSTR_244 (244UL)
#define SEI_INSTR_245 (245UL)
#define SEI_INSTR_246 (246UL)
#define SEI_INSTR_247 (247UL)
#define SEI_INSTR_248 (248UL)
#define SEI_INSTR_249 (249UL)
#define SEI_INSTR_250 (250UL)
#define SEI_INSTR_251 (251UL)
#define SEI_INSTR_252 (252UL)
#define SEI_INSTR_253 (253UL)
#define SEI_INSTR_254 (254UL)
#define SEI_INSTR_255 (255UL)

/* DAT register group index macro definition */
#define SEI_DAT_0 (0UL)
#define SEI_DAT_1 (1UL)
#define SEI_DAT_2 (2UL)
#define SEI_DAT_3 (3UL)
#define SEI_DAT_4 (4UL)
#define SEI_DAT_5 (5UL)
#define SEI_DAT_6 (6UL)
#define SEI_DAT_7 (7UL)
#define SEI_DAT_8 (8UL)
#define SEI_DAT_9 (9UL)
#define SEI_DAT_10 (10UL)
#define SEI_DAT_11 (11UL)
#define SEI_DAT_12 (12UL)
#define SEI_DAT_13 (13UL)
#define SEI_DAT_14 (14UL)
#define SEI_DAT_15 (15UL)
#define SEI_DAT_16 (16UL)
#define SEI_DAT_17 (17UL)
#define SEI_DAT_18 (18UL)
#define SEI_DAT_19 (19UL)
#define SEI_DAT_20 (20UL)
#define SEI_DAT_21 (21UL)
#define SEI_DAT_22 (22UL)
#define SEI_DAT_23 (23UL)
#define SEI_DAT_24 (24UL)
#define SEI_DAT_25 (25UL)
#define SEI_DAT_26 (26UL)
#define SEI_DAT_27 (27UL)
#define SEI_DAT_28 (28UL)
#define SEI_DAT_29 (29UL)
#define SEI_DAT_30 (30UL)
#define SEI_DAT_31 (31UL)


#endif /* HPM_SEI_H */
